# LSE Course 2 Week 3: Convener tutorial videos

## Concat multiple DataFrames with Pandas

### Video brief:
Helping a professor in need with the concat() function: This tutorial is a response to a scenario presented on the page about a request from a professor for help to keep track of her students. The video comes after we've introduced the concat() function and takes the learners through four simple steps to help solve Prof Minnaar issue (which will be presented as an email in the video). Information about the merge() function comes after the video.

#

## Step 1: Import CSV files

In [1]:
# import libraries
import pandas as pd
import numpy as np

In [3]:
# read CSV files
classlist_a = pd.read_csv("classlist_a.csv")
classlist_b = pd.read_csv("classlist_b.csv")
classlist_c = pd.read_csv("classlist_c.csv")
classlist_d = pd.read_csv("classlist_d.csv")

#

## Step 2: Concat four files

In [6]:
# concat all four DataFrames
classlist_final = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])
classlist_final

,Student number,Surname,Initials,Final mark,Class
0,15476227,AFONSO,L,47.72,E
1,15311279,ALBERTYN,F J H,57.52,A
2,15637913,ALEXANDER,L,90.68,E
3,15124150,BAM,A J,56.43,E
4,15829626,BARROW,S B,79.64,E
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E